import React from 'react'
import styles from './poPage.module.css'

const PO = () => {
	return (
		<div className={styles.container}>
			<h1>Публичная оферта</h1>
			<p>Договор публичной оферты купли-продажи товаров</p>
			<p>
				Настоящий договор, адресован Потребителям и является официальным и
				публичным предложением Продавца заключить договор купли-продажи Товара,
				предмет и условия которого указаны в соответствующем разделе сайта
				https://baratech.by. Потребитель, действуя с целью приобретения Товара,
				принимает условия настоящего договора (далее – Договор) о нижеследующем:
			</p>
			<strong>1. Общие положения</strong>
			<p>
				1.1. Настоящий договор является договором публичной оферты (в
				соответствии со ст.ст. 633, 641 и гл. 54 Гражданского кодекса РБ), его
				условия одинаковы для всех покупателей независимо от статуса (физическое
				лицо, юридическое лицо, физическое лицо – предприниматель). 1.2. В
				случае принятия условий настоящего договора, т.е. публичной оферты
				Продавца, потребитель становится Покупателем. 1.3. Заключая Договор,
				Покупатель подтверждает, что целиком и полностью ознакомлен и согласен с
				его условиями, а также, в случае, если Покупатель является физическим
				лицом, дает разрешение на обработку Продавцом своих персональных данных
				с целью возможности выполнения условий настоящего Договора, возможности
				проведения взаиморасчетов, а также для получения счетов, актов и других
				документов. Разрешение на обработку персональных данных действует в
				течение всего срока действия Договора, а также в течение неограниченного
				срока после окончания его действия. Кроме этого, заключением настоящего
				Договора, Заказчик подтверждает, что он уведомлен (без дополнительного
				уведомления) о правах, установленных Законом РБ «О защите персональных
				данных», о целях сбора данных, а также о том, что его персональные
				данные передаются Продавцу с целью возможности выполнения условий
				настоящего Договора, возможности проведения взаиморасчетов, а также для
				получения счетов, актов и других документов. Заказчик также соглашается
				с тем, что Продавец имеет право предоставлять доступ и передавать его
				персональные данные третьим лицам без каких-либо дополнительных
				уведомлений Заказчика, не изменяя при этом цель обработки персональных
				данных. Объем прав Заказчика, как субъекта персональных данных в
				соответствии с Законом РБ «О защите персональных данных» ему известен и
				понятен.
			</p>
			<strong>2. Термины и определения</strong>
			<p>
				2.1. Продавец ведущий управление сайтом, размещенным в сети Интернет по
				адресу https://baratech.by и его зеркалах. 2.2. Товар — опубликованный
				на сайте Интернет-магазина перечень товаров народного потребления, по
				которым указывается цена, название и описание товара. Также товар может
				сопровождаться его изображением. 2.3. Покупатель — дееспособное
				физическое лицо, достигшее восемнадцатилетнего возраста, получающее
				информацию от Продавца, размещающее Заказы на покупку Товаров, которые
				представлены на сайте Интернет-магазина, для целей не связанных с
				осуществлением предпринимательской деятельности, или юридическое
				лицо/физическое лицо-предприниматель. 2.4. Заказ — оформленная и
				размещенная заявка Покупателя на покупку Товаров, адресованная Продавцу.
				2.5. Сайт Интернет-магазина – совокупность страниц, доступ к которым
				осуществляется с помощью веб-браузера, и программных модулей,
				объединенных единой системой управления, расположенных в сети Интернет
				по адресу https://baratech.by и его зеркалах. 2.6. Личный кабинет —
				персональный раздел Покупателя на сайте Продавца, доступ к которому
				имеет Покупатель, в котором отражается его персональная информация и
				история размещенных им Заказов.
			</p>
			<strong>3. Предмет договора</strong>
			<p>
				3.1. Продавец обязуется на условиях и в порядке, определенных настоящим
				договором продавать Товар на основании Заказа, оформленного Покупателем
				на сайте Интернат-магазина, а Покупатель обязуется на условиях и в
				порядке, определенных настоящим договором, покупать Товар и оплачивать
				его стоимость. 3.2. Продавец гарантирует, что Товар не передан в залог,
				не находится в споре, под арестом и на него не распространяются права
				третьих лиц. 3.3. Продавец и Покупатель подтверждают, что настоящий
				договор не является фиктивным, мнимой сделкой, сделкой, совершаемой под
				влиянием насилия или обмана. 3.4. Продавец подтверждает, что имеет все
				необходимые разрешения на осуществление хозяйственной деятельности, что
				регулирует сферу правоотношений, возникающих и действующих в процессе
				исполнения настоящего договора, а также гарантирует, что имеет право на
				производство и/или реализацию товара без каких-либо ограничений, в
				соответствии с требованиями действующего законодательства РБ и обязуется
				нести ответственность в случае нарушения прав Покупателя в процессе
				исполнения настоящего договора и реализации товара. 3.5. Покупатель
				принимает условия настоящего договора в момент оформления Заказа путем
				нажатия на кнопку “Оформить заказ”, что означает подтверждение
				Покупателя о прочтении текста настоящего договора и согласие с его
				условиями. В дальнейшем возражения от Покупателя относительно
				предоставления таким образом своего согласия избавляет Продавца от
				любого рода ответственности за неисполнение условий настоящего договора
				и оставляет право Продавца отменить Заказ в одностороннем порядке.
			</p>
			<strong>4. Правила работы с сайтом Интернет-магазина</strong>
			<p>
				4.1. Покупатель может просматривать содержание сайта Интернет-магазина,
				оформлять Заказы, а также пользоваться другими его сервисами. 4.2.
				Регистрация требуется для доступа Покупателя к персонализированной
				информации и предоставления дополнительных возможностей работы с сайтом
				Интернет-магазина. 4.3. При регистрации Покупатель вводит следующие
				данные: ФИО Номер телефона Адрес электронной почты Физический адрес 4.4.
				Покупатель обязуется предоставить соответствующую действительности,
				точную и полную информацию о себе. Продавец не несет ответственности за
				точность и правильность информации, оставляемой Покупателем при
				регистрации и осуществлении Заказа. 4.5. Покупатель обязуется не
				сообщать третьим лицам параметры доступа, указанные при регистрации. В
				случае возникновения у Покупателя подозрений относительно
				несанкционированного использования третьими лицами таких параметров,
				Покупатель обязуется незамедлительно сообщить об этом Продавцу, направив
				электронное письмо по адресу baratexby@gmail.com 4.6. Покупатель несет
				ответственность за любые действия, осуществленные на сайте
				Интернет-магазина под его учетной записью и от его имени. 4.7. Продавец
				вправе отказать Покупателю в оформлении Заказа, если у него будут
				основания полагать, что Покупатель указал недостоверные данные, а так же
				при условии недобросовестного поведения (к примеру, нарушения условий
				настоящего договора, или др.). 4.8. Запрещено использовать сайт
				Интернет-магазина в противозаконной и запрещенной деятельности.
				Покупатели соглашаются соб людать законы РБ и нормы поведения, принятые
				в сети Интернет, а именно, но не ограничиваясь: размещением на сайте
				Интернет-магазина материалов экстремистского, порнографического или
				иного характера, затрагивающего и/или ущемляющего честь, достоинство
				и/или деловую репутацию третьих лиц и нарушающие общепринятые нормы
				морали, а также размещать рекламную информацию без разрешения Продавца.
				4.9 Сайт https://baratech.by (далее «Сайт») разрешает вам просматривать
				и загружать материалы этого сайта (далее «Сайт») только для личного
				некоммерческого использования, при условии сохранения вами всей
				информации об авторском праве и других сведений о праве собственности,
				содержащихся в исходных материалах и любых их копиях. Запрещается
				изменять материалы этого Сайта, а также распространять или
				демонстрировать их в любом виде или использовать их любым другим образом
				для общественных или коммерческих целей. Любое использование этих
				материалов на других сайтах или в компьютерных сетях запрещается.
			</p>
			<strong>5. Порядок оформления Заказа</strong>
			<p>
				5.1. Покупатель оформляет Заказ на сайте Интернет-магазина
				самостоятельно, путем добавления выбранных Товаров в виртуальную корзину
				и нажимая кнопку “Купить”. 5.2. Оформить Заказ на Товары могут как
				зарегистрированные Покупатели, так и те, что не прошли регистрацию, в
				том числе по номеру телефону, который указан на сайте Интернет-магазина.
			</p>
			<strong>6. Цена и порядок оплаты</strong>
			<p>
				6.1. Цена каждого отдельного Товара определяется Продавцом и указывается
				на сайте Интернет-магазина. Цена Заказа определяется путем сложения цены
				всех включенных в Заказ Товаров и цены доставки, которая равна сумме
				подлежащей к оплате, что указывается на сайте Интернет-магазина при
				оформлении Заказа в момент его размещения. 6.2. Цена договора равна цене
				Заказа. Сумма заказа может изменяться в зависимости от цены, количества
				или номенклатуры Товара. 6.3. Покупатель производит оплату Товара
				согласно Заказа. Покупатель самостоятельно выбирает один с таких
				способов оплаты: наличный расчет; безналичный расчет; с помощью
				электронных платежных систем; с помощью платежных терминалов.
			</p>
			<p>
				6.4. Оплата Услуг осуществляется в национальной валюте РБ. 6.5. Заказ
				считается оплаченным с момента поступления оплаты на расчетный счет
				Продавца или его представителя. Факт оплаты Заказа свидетельствует о
				согласии Покупателя с условиями настоящего договора. 6.6. Доставка
				Заказа Продавцом выполняется после полной оплаты Товара. 6.7. Цена
				Товара, что указана на сайте Интернет-магазина, может быть изменена
				Продавцом в одностороннем порядке. При этом цена на заказанный
				Покупателем Товар изменению не подлежит. 6.8. До момента зачисления
				средств Покупателя на расчетный счет Продавца товар не резервируется.
				Продавец не может гарантировать доступность Товара Продавца в
				количестве, указанном в момент оформления Заказа, в результате чего,
				могут увеличиться сроки обработки Заказа. В случае необходимости
				осуществления возврата денежных средств Продавцом Покупателю для
				осуществления возврата денежных средств Покупатель обязан сообщить
				Продавцу реквизиты банковского счета, на который Продавец обязан
				перечислить денежные средства.
			</p>
			<strong>7. Условия возврата</strong>
			<p>
				7.1. В случае неверного указания цены заказанного Покупателем Товара,
				Продавец при первой возможности информирует об этом Покупателя для
				подтверждения или аннулирования Заказа. При невозможности связаться с
				Покупателем данный Заказ считается аннулированным автоматически. Если
				Заказ был оплачен, Продавец возвращает Покупателю оплаченную за Заказ
				сумму путем ее перечисления на счет Покупателя или другим приемлемым
				способом. 7.2. При оформлении Заказа, Покупатель соглашается с тем, что
				он имеет право отказаться только от всего Заказа, а не от его части.
			</p>
			<strong>8. Обязанности Продавца</strong>
			<p>
				8.1. Предоставлять правдивую информацию о Товарах, ценах на них а также
				условиях доставки Товара. 8.2. Поставить Товар в соответствии с
				условиями Заказа. 8.3. Гарантировать соответствие качества Товара
				требованиям качества на территории РБ. Обеспечить гарантийные
				обязательства в соответствии с условиями настоящего Договора. 8.4. В
				случае изменения срока поставки, немедленно информировать Покупателя об
				изменении условий поставки. Продавец информирует Покупателя посредством
				телефонной или электронной связи. При невозможности связаться с
				Покупателем в случае нарушения последним п. 4.4 настоящего договора
				Продавец не несет ответственности перед Покупателем согласно условий
				настоящего договора и норм действующего законодательства.
			</p>
			<strong>9. Обязанности Покупателя</strong>
			<p>
				9.1. Предоставлять Продавцу достоверную, правдивую и корректную
				информацию, в том числе при регистрации на сайте Интернет-магазина. 9.2.
				Оплачивать Товар, согласно Заказов, по указанной в них цене. 9.3. При
				приеме Заказа провести внешний осмотр на предмет внешнего повреждения
				упаковки в случае отсутствия внешних повреждений упаковки подписаться в
				накладной (квитанции, реестре и т.д.) о получении Заказа. Открыть в
				присутствии представителя службы доставки внешнюю упаковку с целью
				проверки сохранности вложенного, осмотреть Товар на предмет целостности
				его индивидуальной упаковки и наличия внешних повреждений на ней. 9.4. В
				случае наличия претензий потребовать от представителя службы поставки
				составить Акт внешнего осмотра и Акт приема-передачи в 3-х экземплярах.
				В акте осмотра описываются повреждения внешней упаковки, а в Акте
				приема-передачи описываются все повреждения индивидуальной упаковки
				товара. 9.5. В случае передачи Продавцом Товара с нарушением условий
				Заказа о количестве, ассортименте, комплектности, таре и (или) упаковке
				Товара, - не позднее 5 (пяти) следующих за днем покупки (получения),
				календарных дней известить Продавца об этих нарушениях. При этом Товар
				должен быть возвращен в товарном виде с сохранением потребительских
				свойств и всех ярлыков, пломб и т.п. 9.6. Предоставить точные паспортные
				данные для возможности получить Заказ в офисе курьерской компании, и
				лично явиться с паспортом.
			</p>
			<strong>10. Права Покупателя</strong>
			<p>
				10.1. Требовать возврата оплаты Товара в случае невозможности исполнения
				Продавцом условий Заказа. 10.2. Внести изменения в Заказ до его оплаты.
				10.3. До передачи Товара отказаться от исполнения договора при условии
				возмещения Продавцу транспортных расходов, понесенных Продавцом в связи
				с совершением действий по выполнению настоящего договора. 10.4. При
				возникновении претензий к качеству Товара, предъявить их в сроки и в
				соответствии с Законом РБ «О защите прав потребителей».
			</p>
			<strong>11. Ответственность сторон</strong>
			<p>
				11.1. Продавец не несет ответственности за ущерб, причиненный Покупателю
				вследствие ненадлежащего использования Товаров, заказанных на сайте
				Интернет-магазине. 11.2. Продавец не несет ответственности за
				ненадлежащее, несвоевременное выполнение Заказов и своих обязательств по
				настоящему Договору в случае предоставления Покупателем недостоверной
				или ложной информации. 11.3. Продавец и Покупатель несут ответственность
				за исполнение обязательств по настоящему Договору в соответствии с
				действующим законодательством РБ. 11.4. Продавец и/или Покупатель
				освобождаются от ответственности за полное или частичное неисполнение
				своих обязательств, если неисполнение является следствием таких
				непреодолимых обстоятельств как: война или военные действия,
				землетрясение, наводнение, пожар и другие стихийные бедствия, акты или
				действия органов государственной власти, изменение таможенных правил,
				ограничения импорта и экспорта, что возникли независимо от воли Продавца
				и/или Покупателя после заключения настоящего договора. Сторона, которая
				не может исполнить свои обязательства, незамедлительно уведомляет об
				этом другую Сторону и предоставляет документы, подтверждающие наличие
				таких обстоятельств, выданные уполномоченными на то органами. 11.5
				Материалы и услуги этого сайта предоставляются «как есть» без каких-либо
				гарантий. Сайт не гарантирует точности и полноты материалов, программ и
				услуг, предоставляемых на этом Сайте. Сайт в любое время без уведомления
				может вносить изменения в материалы и услуги, предоставляемые на этом
				Сайте, а также в упомянутые в них продукты и цены. В случае устаревания
				материалов и услуг на этом Сайте Розетка не обязуется обновлять их. Сайт
				ни при каких обстоятельствах не несет ответственности за любой ущерб
				(включая, но не ограничиваясь ущербом от потери прибыли, данных или от
				прерывания деловой активности), возникший вследствие использования,
				невозможности использования или результатов использования этого сайта.
				11.6 Обращаясь к нам или оставляя комментарии на сайте, вы несете
				ответственность, что данное сообщение не является незаконным,
				вредоносным, угрожающим, клеветническим, оскорбляет нравственность,
				нарушает авторские права, пропагандирует ненависть и/или дискриминацию
				людей по расовому, этническому, половому, религиозному, социальному
				признакам, содержит оскорбления в адрес конкретных лиц или организаций,
				а также каким либо иным образом нарушает действующее законодательство
				РБ. Вы соглашаетесь, что любое ваше сообщение сайт может удалять без
				вашего на то согласия, а также безвозмездно использовать по своему
				усмотрению. Сайт не несет ответственности за любую информацию
				размещенную пользователями Сайта.
			</p>
			<strong>12. Конфиденциальность и защита персональных данных</strong>
			<p>
				12.1. При регистрации на сайте Интернет-магазина Покупатель оставляет
				персональные и контактные данные, указанные в п.4.3. настоящего
				договора, но не ограничивающиеся им. 12.2. Предоставляя свои
				персональные данные на сайте Интернет-магазина при регистрации или
				оформлении Заказа, Покупатель дает свое добровольное согласие на
				обработку и использование (в том числе и передачу) своих персональных
				данных без ограничения срока действия такого согласия в соответствии с
				Законом РБ «О защите персональных данных». 12.3. Продавец использует
				полученные персональные данные для оказания услуг, определенных
				настоящим договором, для продвижения услуг, предоставляемых Продавцом, в
				том числе и при помощи автоматизированной обработки персональных данных.
				12.4. Продавец обязуется не разглашать полученную от Покупателя
				информацию. Не считается нарушением предоставление Продавцом информации
				агентам и третьим лицам, действующим на основании договора с Продавцом,
				в том числе и для исполнения обязательств перед Покупателем, а также в
				случаях, когда раскрытие такой информации установлено требованиями
				законодательства. 12.5. Покупатель несет ответственность за поддержание
				своих персональных данных в актуальном состоянии. Продавец не несет
				ответственности за некачественное исполнение или неисполнение своих
				обязательств в связи с неактуальностью информации о Покупателе или
				несоответствием ее действительности. 12.6 Мы используем различные
				технологии для сбора и хранения информации, когда вы посещаете сайт
				Розетка (подробнее о защите и обработке персональных данных). Это может
				включать в себя запись одного или нескольких куки или анонимных
				идентификаторов. Мы также используем куки и анонимные идентификаторы,
				когда вы взаимодействуете с услугами, предложенными нашими партнерами,
				такими как рекламные услуги, например, которые могут появиться на других
				сайтах.
			</p>
			<strong>13. Информационные сообщения</strong>
			<p>
				13.1. Регистрируясь на сайте Интернет-магазина, Покупатель дает Продавцу
				согласие на получение информационных сообщений от Продавца и его
				партнеров, действующих на основании договора с Продавцом, посредством
				служб коротких сообщений (SMS) и электронной почты. 13.2. В любой момент
				Покупатель вправе отказаться от получения такой рассылки, написав
				уведомление на baratexby@gmail.com
			</p>
			<strong>
				14. Правила использования материалов, размещенных на сайте
				Интернет-магазина
			</strong>
			<p>
				14.1. Сайт Интернет-магазина содержит материалы, товарные знаки,
				фирменные наименования и иные охраняемые законом материалы, включая, но
				не ограничиваясь, тексты, фотографии, графические изображения,
				музыкальные и звуковые произведения. 14.2. Все содержание сайта
				Интернет-магазина охраняется законодательством РБ. 14.3. Покупатель не
				имеет права использовать материалы, размещенные на сайте
				Интернет-магазина, как то: вносить изменения, публиковать, передавать
				третьим лицам, участвовать в продаже или уступке, создавать производные
				продукты и др.
			</p>
			<strong>15. Прочие условия</strong>
			<p>
				15.1. Настоящий договор заключен на территории РБ и действует в рамках
				законодательства РБ. 15.2. Недействительность какого-либо пункта или
				части настоящего договора не ведет к недействительности договора в
				целом. 15.3. Все споры, возникающие между Покупателем и Продавцом,
				решаются путем переговоров. В случае не достижения урегулирования
				спорного вопроса, Покупатель или Продавцом могут обратиться за
				разрешением спора в судебные органы в соответствии с действующим
				законодательством. 15.4. Продавец вправе вносить изменения в текст
				настоящего договора по собственному усмотрению в любой момент и без
				предварительного уведомления Покупателей. Актуальная (действующая)
				редакция договора всегда доступна на сайте Интернет-магазина. 15.5.
				Отсутствие подписанного между Продавцом и Покупателем экземпляра
				настоящего договора на бумажном носителе, с проставлением подписей
				сторон, в случае проведения по нему фактической оплаты Покупателем, не
				является основанием признания настоящего Договора не заключенным.
				Проведение оплаты в соответствии со сделанным Заказом на сайте
				Интернет-магазина считается акцептом Покупателя (в соответствии со ст.
				642 и гл. 54 Гражданского кодекса РБ) и является моментом вступления
				Договора в силу. 15.6. При возникновении претензий Потребитель должен
				обратиться в Службу поддержки Продавца.
			</p>
		</div>
	)
}

export default PO
