import React from 'react'
import styles from './guaranteePage.module.css'

const ReturnOfGoods = () => {
	return (
		<div className={styles.container}>
			<h1>Возврат товара</h1>
			<p>Основные условия и покупателя по возврату товара</p>
			<strong>
				Возврат товара Я (Покупатель) принимаю условия Пользовательского
				соглашения/оферты Пользовательское соглашение/Оферта
			</strong>
			<p>
				Настоящее соглашение/оферта содержит основные условия, в соответствии с
				которыми осуществляется продажа товаров/услуг. Покупатель вправе не
				принимать настоящее пользовательское соглашение/оферту, что повлечет за
				собой отказ от заключения договора.
			</p>
			<strong>О Покупателе и платежах</strong>
			<p>
				Покупатель подтверждает, что он имеет право на заключение договора
				купли-продажи товара и что информация, предоставляемая им, является
				достоверной.
			</p>
			<strong>Об информации на сайте и информации о товаре</strong>
			<p>
				Владельцем данного сайта bartech.by приняты все разумные меры к тому,
				чтобы обеспечить точность и актуальность размещенной на этом сайте
				информации, однако ее точность и полнота не могут быть гарантированы.
				Владелец сайта оставляет за собой право вносить изменение в содержание
				материалов этого сайта в любое время по собственному усмотрению.
				Владельцем сайта является юридическое лицо, указанное в низу стартовой
				страницы сайта. Владелец сайта может не совпадать с владельцем,
				соответствующего доменного имени сайта.
			</p>
			<strong>
				Об ограничении ответственности при использовании информацией с сайта
			</strong>
			<p>
				При любом развитии событий, в связи с возможностью/невозможностью
				использования ресурсов данного сайта, а также в связи с использованием
				любой информации с данного сайта кем-либо, если такое использование или
				невозможность исполнения информации принесло какой-либо вред, Владелец
				сайта и его контрагенты не несут ответственности за какой-либо прямой,
				косвенной, случайный либо сопутствующий ущерб, в особенности, ущерб от
				упущенной выгоды, потери прибыльности, роста доходов, потери информации
				и т.п.
			</p>
			<strong>О правах третьих лиц, копировании информации</strong>
			<p>
				Товарные знаки, изображенные на данном сайте, принадлежат их владельцам
				и не могут быть использованы третьими лицами без разрешения владельцев.
				Размещение товарных знаков на данном сайте не предоставляет третьим
				лицам никаких прав на копирования товарных знаков и размещения их на
				других ресурсах (товарах). Копирование информации с данного сайта и
				размещение на других ресурсах в коммерческих целях не допускается.
			</p>
			<strong>О заключении договора</strong>
			<p>
				Покупатель, изъявляющий желание пробрести товар на сайте посредством
				заполнения специальных форм, создает и направляет заявку на обработку и
				комплектацию посылки. Продавец товара гарантирует отправку посылки
				только после ее комплектации. Продавец товара не гарантирует
				комплектацию посылки; часть товара отбраковывается при комплектации и
				Покупателю не высылается, а почтовое отправление не комплектуется.
				Договор считается заключенным с даты вручения товара Покупателю и его
				оплаты.
			</p>
			<strong>О доставке, в случае доставки товара</strong>
			<p>
				Покупателю третьими лицами (Белпочта, курьерские службы и т.д.), сроки
				доставки и правила доставки регулируются правилами, действующими в этих
				организациях. При оформлении покупки на сайте или по телефону,
				Покупателю будут предложены различные варианты доставки, действующие в
				текущий момент времени для его региона.
			</p>
			<strong>О возврате товара</strong>
			<p>
				Товар вместе с товарной упаковкой должен быть помещен в посылку. Не
				допускается возврат товара без дополнительной почтовой упаковки.
				<br />
				Покупатель вправе возвратить товар надлежащего качество в течение 7
				дней, при условии сохранения его потребительских свойств, товарного вида
				и документов, прилагаемых к товару при покупке, его упаковки.
				<br />
				Покупатель вправе возвратить товар ненадлежащего качества в пределах его
				гарантийного срока, который равен 1 году и исчисляется с даты получения
				Товара Покупателем. Если в документах, сопровождающих товар, установлен
				другой срок, Гарантийный срок равен этого другому сроку.
				<br />
				Возврат любого товара производится по адресу, указанному в
				Договоре-заказе, а именно в Заявлении на возврат товара.
			</p>
		</div>
	)
}

export default ReturnOfGoods
